app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 33], ["cart_id", 8], ["created_at", "2018-12-20 19:37:48.107971"], ["updated_at", "2018-12-20 19:37:48.107971"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2018-12-20 19:37:50.505884"], ["id", 12]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save