app/controllers/store_controller.rb

SELECT "products".* FROM "products"
---
  def filterProducts
    @header = params[:sort]
    @products = if @header == 'Other'
                  Product.all.select { |product| product.prod_type == 'Sunglasses' || product.prod_type == 'Other' }